#include <locale.h>;
#include <stdio.h>;

void main()
{
	setlocale(LC_ALL, "RUS");

	printf("123\n"); // подзадание 1

	printf("1\n2\n3\n"); // подзадание 2

	printf("1\n\t2\n\t\t3\n"); // подзадание 3

	printf("%d, %d, %d, %d\n", 1, 2, 3, 4); // подзадание 4

	printf(" %-10.3f\n ", 12.234657); // подзадание 5

	printf("%-10.5f\n ", 12.234657); // подзадание 6

	printf("Остаток от деления %d на %d равен %d\n ", 5, 2, 5 % 2); // подзадание 7

	printf("%1.0f разделить на %1.0f равно %1.1f\n", 7., 5., 7./5.);  // подзадание 8

	printf(" %d умножить на %d равно %d\n\n", 2000, 4, 2000*4); // подзадание 9

	printf(" %g разделить %e равно %f\n", 5., 2000000., 5. / 2000000); //подзадание 10
	printf(" %d разделить %d равно %d\n", 5., 2000000., 5. / 2000000);
	printf(" %f разделить %f равно %f\n", 5., 2000000., 5. / 2000000);
	printf(" %g разделить %g равно %g\n", 5., 2000000., 5. / 2000000);
	printf(" %e разделить %e равно %e\n", 5., 2000000., 5. / 2000000);

	return 0;
}
